JEB12345/dwm1000_dspic/dwm_spi.c
    // We do want to enable auto RX
    dwt_setautorxreenable(1);
    // Let's do double buffering
    dwt_setdblrxbuffmode(0);
    // Disable RX timeout by setting to 0
    dwt_setrxtimeout(0);

    // Try pre-populating this
    msg.seqNum++;
    msg.messageType = MSG_TYPE_ANC_RESP;
    fin_msg.messageType = MSG_TYPE_ANC_FINAL;

    //Reset all the distance measurements
    memset(fin_msg.distanceHist, 0, sizeof(fin_msg.distanceHist));

//    } else if (DW1000_ROLE_TYPE == TAG) {
//    uint8_t eui_array[8];

//        // Allow data and ack frames
//        dwt_enableframefilter(DWT_FF_DATA_EN | DWT_FF_ACK_EN);

//        dw1000_populate_eui(eui_array, TAG_EUI);
//        dwt_seteui(eui_array);
//        dwt_setpanid(DW1000_PANID);

    // Set more packet constants
    bcast_msg.sourceAddr = NODE_ID;

//        // Do this for the tag too
//        dwt_setautorxreenable(1);
//        dwt_setdblrxbuffmode(0);
//        dwt_enableautoack(5 /*ACK_RESPONSE_TIME*/);

    // Configure sleep
    int mode = DWT_LOADUCODE    |
               DWT_PRESRV_SLEEP |
               DWT_CONFIG       |
               DWT_TANDV;
    if (dwt_getldotune() != 0) {
        // If we need to use LDO tune value from OTP kick it after sleep
        mode |= DWT_LOADLDO;
    }
    // NOTE: on the EVK1000 the DEEPSLEEP is not actually putting the
    // DW1000 into full DEEPSLEEP mode as XTAL is kept on
    dwt_configuresleep(mode, DWT_WAKE_CS | DWT_SLP_EN);

//    }

    // Go for receiving
    dwt_rxenable(0);
    
    // Turn status LEDs on DWM1000
    dwt_setleds(1);

    return result;
}

// Triggered after a TX
void app_dw1000_txcallback (const dwt_callback_data_t *txd) {
    //NOTE: No need for tx timestamping after-the-fact (everything's done beforehand)
}

// Triggered when we receive a packet
void app_dw1000_rxcallback (const dwt_callback_data_t *rxd) {
    int err;

//    if (DW1000_ROLE_TYPE == TAG) {

        // The tag receives one packet: "ANCHOR RESPONSE"
        // Make sure the packet is valid and matches an anchor response.
        // Need to timestamp it and schedule a response.

        if (rxd->event == DWT_SIG_RX_OKAY) {
            struct ieee154_msg* msg_ptr;
            uint8_t packet_type_byte;
            struct ieee154_bcast_msg* bmsg_ptr;
            uint8_t packet_type_byte;
            uint64_t rxtimestamp;
            uint64_t systimestamp;
            uint8_t subseq_num;

            // Get the timestamp first
            uint8_t txTimeStamp[5] = {0, 0, 0, 0, 0};
//            global_tag_anchor_resp_rx_time = dwt_readrxtimestamphi32();
            dwt_readrxtimestamp(txTimeStamp);
            global_tag_anchor_resp_rx_time = (uint64_t) txTimeStamp[0] +
                                             (((uint64_t) txTimeStamp[1]) << 8) +
                                             (((uint64_t) txTimeStamp[2]) << 16) +
                                             (((uint64_t) txTimeStamp[3]) << 24) +
                                             (((uint64_t) txTimeStamp[4]) << 32);

            // Get the packet
            dwt_readrxdata(global_recv_pkt, rxd->datalength, 0);
            msg_ptr = (struct ieee154_msg*) global_recv_pkt;
            packet_type_byte = global_recv_pkt[offsetof(struct ieee154_msg, messageType)];

            // Packet type byte is at a know location
            if (packet_type_byte == MSG_TYPE_ANC_RESP) {
                // Great, got an anchor response.
                // Now send a final message with the timings we know in it

                // First, set the time we want the packet to go out at.
                // This is based on our precalculated delay plus when we got
                // the anchor response packet. Note that we only add the upper
                // 32 bits together and use that time because this chip is
                // weird.
                uint8_t anchor_id = msg_ptr->anchorID;

                dwt_forcetrxoff();
                uint16_t tx_frame_length = sizeof(bcast_msg);
                
                bcast_msg.seqNum++;
                bcast_msg.messageType = MSG_TYPE_TAG_FINAL;
                // Put at beginning of TX fifo
                dwt_writetxfctrl(tx_frame_length, 0);
                
                dwt_setrxtimeout(0);
                
                uint8_t TimeStamp[5] = {0, 0, 0, 0, 0};
                dwt_readsystime(TimeStamp);
                uint64_t systimestamp = (uint64_t) TimeStamp[0] +
                        (((uint64_t) TimeStamp[1]) << 8) +
                        (((uint64_t) TimeStamp[2]) << 16) +
                        (((uint64_t) TimeStamp[3]) << 24) +
                        (((uint64_t) TimeStamp[4]) << 32);

                //TODO: Hack.... But not sure of any other way to get this to time out correctly...
//                dwt_setrxtimeout(NODE_DELAY_US*(NUM_ANCHORS-anchor_id)+ANC_RESP_DELAY+1000);
//                uint32_t temp = dwt_readsystimestamphi32();
//                uint32_t delay_time = temp + ((convertmicrosectodevicetimeu32(TAG_SEND_FINAL_DELAY_US)>>8));
                uint32_t delay_time = (uint32_t)((systimestamp)>>8) + ((convertmicrosectodevicetimeu32(TAG_SEND_FINAL_DELAY_US)>>8));
                delay_time &= 0xFFFFFFFE;
                dwt_setdelayedtrxtime(delay_time);
                // Set the packet length
//                uint16_t tx_frame_length = offsetof(struct ieee154_bcast_msg, tRR) + 2;//TODO: this is wrong
                
                // Need to actually fill out the packet
                to_lower_40bits(bcast_msg.tRR[0], global_tag_anchor_resp_rx_time);
                to_lower_40bits(bcast_msg.tSF,systimestamp + (convertmicrosectodevicetimeu(TAG_SEND_FINAL_DELAY_US)));
                
                dwt_writetxdata(tx_frame_length, (uint8_t*) &bcast_msg, 0);
                err = dwt_starttx(DWT_START_TX_DELAYED | DWT_RESPONSE_EXPECTED);
                dwt_settxantennadelay(global_tx_antenna_delay);
                tag_state = tag_stall;

            } else if(packet_type_byte == MSG_TYPE_ANC_FINAL){
                struct ieee154_final_msg* final_msg_ptr;
                final_msg_ptr = (struct ieee154_final_msg*) global_recv_pkt;
                int offset_idx = (final_msg_ptr->anchorID-1)*NUM_ANTENNAS*NUM_ANTENNAS*NUM_CHANNELS;
                memcpy(&global_distances[offset_idx],final_msg_ptr->distanceHist,sizeof(fin_msg.distanceHist));
            }
//        } else if (rxd->event == DWT_SIG_RX_TIMEOUT) {
//
//        }

//    } else if (DW1000_ROLE_TYPE == ANCHOR) {

        // The anchor should receive two packets: a POLL from a tag and
        // a FINAL from a tag.

