JEB12345/dwm1000_dspic/dwm_spi.c
                // Get ready to receive next POLL
                anchor_state = anchor_wait_receive;
                dwt_rxenable(0);
            }
        }
        else{
            dwt_rxenable(0);
        }
//    }
}

void send_poll(){
    //Reset all the tRRs at the beginning of each poll event
	memset(bcast_msg.tRR, 0, sizeof(bcast_msg.tRR));//TODO: hacked
    //bcast_msg.tRR = 0;//_H = bcast_msg.tRR_L = 0;
    
	// Through tSP (tSF is field after) then +2 for FCS
    uint16_t tx_frame_length = sizeof(bcast_msg);

	bcast_msg.seqNum++;
//	bcast_msg.subSeqNum = global_subseq_num;

	// First byte identifies this as a POLL
	bcast_msg.messageType = MSG_TYPE_TAG_POLL;

	// Tell the DW1000 about the packet
	dwt_writetxfctrl(tx_frame_length, 0);

	// We'll get multiple responses, so let them all come in
	dwt_setrxtimeout(0);

	// Delay RX?
//	dwt_setrxaftertxdelay(1); // us
    
    uint8_t TimeStamp[5] = {0, 0, 0, 0, 0};
    dwt_readsystime(TimeStamp);
    uint64_t systimestamp = (uint64_t) TimeStamp[0] +
                (((uint64_t) TimeStamp[1]) << 8) +
                (((uint64_t) TimeStamp[2]) << 16) +
                (((uint64_t) TimeStamp[3]) << 24) +
                (((uint64_t) TimeStamp[4]) << 32);

    uint32_t delay_time = (uint32_t)((systimestamp)>>8) + ((convertmicrosectodevicetimeu32(TAG_SEND_POLL_DELAY_US)>>8));
	delay_time &= 0xFFFFFFFE; //Make sure last bit is zero
	dwt_setdelayedtrxtime(delay_time);
    uint64_t tSP_tmp = systimestamp + (convertmicrosectodevicetimeu(TAG_SEND_POLL_DELAY_US));
    to_lower_40bits(bcast_msg.tSP,tSP_tmp);
	
	// Write the data
	dwt_writetxdata(tx_frame_length, (uint8_t*) &bcast_msg, 0);

	// Start the transmission
	dwt_starttx(DWT_START_TX_DELAYED | DWT_RESPONSE_EXPECTED);

	// MP bug - TX antenna delay needs reprogramming as it is
	// not preserved
	dwt_settxantennadelay(TX_ANTENNA_DELAY);
}

void instance_process(){
    
    switch(multiBroadcast_states){
        case init:
            multiBroadcast_states = poll;
            break;
            
        case poll:
            stall_count = 0;
//            dwt_forcetrxoff();  // Force the tx or rx state off
            send_poll();
            multiBroadcast_states = wait_response;
            break;
            
        case wait_receive:
            break;
            
        case wait_response:
            break;
            
        case wait_final:
            break;
            
        case final:
            break;
            
        case stall:
            break;
    }

//#ifdef IS_TAG
//    switch(tag_state){
//        case tag_init:
//            tag_state = tag_poll;
//            break;
//
//        case tag_poll:
//            stall_count = 0;
//            dwt_forcetrxoff();  // Force the tx or rx state off
//            send_poll();
//            tag_state = tag_wait_response;
//            break;
//
//        case tag_wait_response:
//            wait_count++;
//            if(wait_count > 200){
//                tag_state = tag_poll;
//                wait_count = 0;
//            }
//            break;
//
//        case tag_final:
//            wait_count = 0;
//            break;
//
//        case tag_stall:
//            stall_count++;
//            if(stall_count > 50){
//                tag_state = tag_poll;
//                stall_count = 0;
//            }
//            break;
//    }
//#endif
//#ifdef IS_ANCHOR
//    switch(anchor_state){
//        case anchor_init:
//            anchor_state = anchor_wait_receive;
//            break;
//
//        case anchor_wait_receive:
//            // Waiting for poll message
//            break;
//
//        case anchor_wait_final:
//            // Waiting for final message
//            break;
//    }
//#endif
}

void incr_subsequence_counter(){
    global_subseq_num++;
    if(global_subseq_num > NUM_ANTENNAS*NUM_ANTENNAS*NUM_CHANNELS+1){
        global_subseq_num = 0;
    }
}

// -------------------------------------------------------------------------------------------------------------------
// convert microseconds to device time
uint32_t convertmicrosectodevicetimeu32 (double microsecu)
{
    uint32_t dt;
    long double dtime;

    dtime = (microsecu / (double) DWT_TIME_UNITS) / 1e6 ;

    dt =  (uint32_t) (dtime) ;

    return dt;
}

// convert microseconds to device time
uint64_t convertmicrosectodevicetimeu (double microsecu)
{
    uint64_t dt;
    long double dtime;

    dtime = (microsecu / (double) DWT_TIME_UNITS) / 1e6 ;

    dt =  (uint64_t) (dtime) ;

    return dt;
}

/**
 * This function is the low level function used by the decaWave DWM1000 API
 */
int writetospi( uint16_t headerLength,
                const uint8_t *headerBuffer,
                uint32_t bodylength,
                const uint8_t *bodyBuffer)
{
    nSELECT = 0;
    write_data_SPI(headerBuffer, headerLength);
    write_data_SPI(bodyBuffer, bodylength);
    nSELECT = 1;
    return DWT_SUCCESS;
}

/**
 * This function is the low level function used by the decaWave DWM1000 API
 */
 int readfromspi( uint16_t	headerLength,
                const uint8_t *headerBuffer,
                uint32_t readlength,
                uint8_t *readBuffer)
 {
    nSELECT = 0;
    write_data_SPI(headerBuffer, headerLength);
    read_data_SPI(readlength, readBuffer);
    nSELECT = 1;
    return DWT_SUCCESS;
 }

/**
 * Reads num_bytes of data from the device
 */
void read_data_SPI(uint16_t num_bytes, uint8_t* rec)
{
    uint16_t cur_byte;
    for(cur_byte=0;cur_byte<num_bytes;cur_byte++){
        SPI2BUF = 0x00;
        while(!SPI2STATbits.SPIRBF);
        rec[cur_byte] = (uint8_t)(SPI2BUF&0xFF);
    }
}

/**
 * Writes num_bytes of data to the device
 */
void write_data_SPI(const uint8_t* data, uint16_t num_bytes)
{
    uint16_t cur_byte;
    uint8_t blahRead;
    for(cur_byte=0;cur_byte<num_bytes;cur_byte++){
        SPI2BUF = data[cur_byte];
        while(!SPI2STATbits.SPIRBF);
        blahRead = SPI2BUF;
    }
}

/**
 * Code Copied directly or modified
 * from polypoint github code
 * https://github.com/lab11/polypoint
 */
void dw1000_populate_eui (uint8_t *eui_buf, uint8_t id) {
  eui_buf[0] = id;
  eui_buf[1] = 0x55;
  eui_buf[2] = 0x44;
  eui_buf[3] = 'N';
  eui_buf[4] = 'P';
  eui_buf[5] = 0xe5;
  eui_buf[6] = 0x98;
  eui_buf[7] = 0xc0;
}
/*****https://github.com/lab11/polypoint******/

/**
 * This interrupt function is tied to the IRQ pin from the DWM1000 module
 */
void __attribute__((__interrupt__, __no_auto_psv__)) _INT2Interrupt(void)
{
    // This is the interrupt handler used by the DWM1000 API library.
    dwm_status.irq_enable = 1;
    IFS1bits.INT2IF = 0;
}
